import React from 'react'

export default function Bio(): JSX.Element {
  return (
    <div>
      <p>Я - опытный Frontend разработчик и ищу работу на позицию Frontend разработчик.
Стараюсь быть в курсе последних новинок в разработке, планирую изучать микросервисную архитектуру, next js.
Легко нахожу общий язык с коллегами, работаю с продвинутыми технологиями, умею решать конфликты.

Будучи юристом по образованию и по первой специальности, имею хорошие софт-скиллы умею найти подход к людям и опыт работы в команде и организаторские способности.

Уровень английского: B-2

Увлекаюсь походами в горы, LARP (Live Action Role PlayGame),сам ставил несколько ролевых игр, а также историей и психологией.</p>
      </div>
  )
}
