import React from 'react';

export default function Experience(): JSX.Element {
  return (
    <>
      <h2>Общий опыт работы Frontend разработччиком - более 3.5 лет</h2>
      <h3>
        Более двух лет работал в компании Tribune, которая разрабатывает приложение для организации
        HR работы внутри компании.
      </h3>
      <ul>Что было мной сделано за время работы:</ul>
      <li>
 
       Реализовал рендеринг списка сотрудников и сопутствующий функционал, обеспечив удобное и
        интуитивно понятное представление данных на клиенте.
      </li>

      <li>
        Разработал и внедрил сортировку сотрудников по грейду, улучшив систему поиска и
        фильтрации данных, что позволило пользователям легко ориентироваться в списке сотрудников.
      </li>
      <li>
        Разработал новый функционала для автоматизации процессов управления персоналом, включая
        систему отслеживания заявок на отпуск, управление рабочими графиками и автоматизацию
        процессов оценки сотрудников.
      </li>
      <li>
       Разрабатывал и поддерживал UI-компоненты с использованием React, внедрял новые функции,
        такие как дашборды для анализа производительности сотрудников, системы уведомлений, а также
        интеграция с внешними API для обеспечения полной функциональности HR-инструментов.
      </li>
      <li>
         Проводил рефакторинг кода, оптимизировал существующую логику приложения, повышал
        производительность и устойчивость системы.
      </li>

      <li>
        Осуществлял техническую поддержку, исправление багов и улучшение пользовательского
        интерфейса.
      </li>
      <li>
        Разрабатывал внутреннюю логику приложения, включая управление состоянием с использованием
        Zustand и RTK Query, реализацию REST API для взаимодействия с бэкендом на Node.js, а также
        обеспечивал тестирование функциональности с помощью Jest.
      </li>
    </>
  );
}
